typetok->symtype->kind: 7
typetok->symtype->kind: 4
typetok->symtype->kind: 9
typetok->symtype->kind: 7
do point
john
var->symtype->kind: 9
var->symtype->datatype->kind: 8
reducedot
var->symtype->kind: 7
(^ john)
referenceTok->symtype->datatype->kind: 7
reducedot
var->symtype->kind: 7
(aref (^ john)
      16)
do point
john
var->symtype->kind: 9
var->symtype->datatype->kind: 8
reducedot
var->symtype->kind: 7
(^ john)
referenceTok->symtype->datatype->kind: 7
reducedot
var->symtype->kind: 7
(aref (^ john)
      16)
yyparse result =        0
Symbol table level 1
 94110585229392     complex  TYPE   typ 94110585229104  lvl  1  siz    16  off     0
(RECORD (re real)
        (im real))
 94110585238464         red  CONST  typ INTEGER  val  0
 94110585238624       white  CONST  typ INTEGER  val  1
 94110585238784        blue  CONST  typ INTEGER  val  2
 94110585238976       color  TYPE   typ 94110585238880  lvl  1  siz     4  off     0
  0 ..   2
 94110585239392      person  TYPE   typ 94110585241216  lvl  1  siz    48  off     0
(RECORD (age integer)
        (friend (^ person))
        (location (RECORD (re real)
                          (im real)))
        (favorite   0 ..   2)
        (salary real))
 94110585239584          pp  TYPE   typ 94110585239488  lvl  1  siz     8  off     0
(^ person)
 94110585242176        john  VAR    4 typ 94110585239488  lvl  1  siz     8  off     0
(^ person)
(program graph1 (progn output)
                (progn (:= (aref (^ john)
                                 16)
                           3.000000e+00)
                       (:= (aref (^ john)
                                 24)
                           4.500000e+00)))