reduce dot var: 
(^ john)
recsym->namestring: 
curfield->namestring: age
curfield->namestring: friend
curfield->namestring: location
offset: 16
reduce dot var: 
(aref (^ john)
      16)
recsym->namestring: location
curfield->namestring: 
offset: 0
reduce dot var: 
(^ john)
recsym->namestring: 
curfield->namestring: age
curfield->namestring: friend
curfield->namestring: location
offset: 16
reduce dot var: 
(aref (^ john)
      16)
recsym->namestring: location
curfield->namestring: 
offset: 0
yyparse result =        0
Symbol table level 1
 94588755484752     complex  TYPE   typ 94588755484464  lvl  1  siz    16  off     0
(RECORD (re real)
        (im real))
 94588755485616         red  CONST  typ INTEGER  val  0
 94588755485776       white  CONST  typ INTEGER  val  1
 94588755485936        blue  CONST  typ INTEGER  val  2
 94588755486128       color  TYPE   typ 94588755486032  lvl  1  siz     4  off     0
  0 ..   2
 94588755486544      person  TYPE   typ 94588755488368  lvl  1  siz    48  off     0
(RECORD (age integer)
        (friend (^ person))
        (location (RECORD (re real)
                          (im real)))
        (favorite   0 ..   2)
        (salary real))
 94588755486736          pp  TYPE   typ 94588755486640  lvl  1  siz     8  off     0
(^ person)
 94588755489328        john  VAR    4 typ 94588755486640  lvl  1  siz     8  off     0
(^ person)
(program graph1 (progn output)
                (progn (:= (aref (^ john)
                                 16)
                           3)
                       (:= (aref (^ john)
                                 16)
                           4.500000e+00)))