reduce dot var: 
(^ john)
recsym->namestring: 
curfield->namestring: age
curfield->namestring: friend
curfield->namestring: location
offset: 16
reduce dot var: 
(aref (^ john)
      16)
recsym->namestring: location
curfield->namestring: 
offset: 0
reduce dot var: 
(^ john)
recsym->namestring: 
curfield->namestring: age
curfield->namestring: friend
curfield->namestring: location
offset: 16
reduce dot var: 
(aref (^ john)
      16)
recsym->namestring: location
curfield->namestring: 
offset: 0
yyparse result =        0
Symbol table level 1
 94915010551888     complex  TYPE   typ 94915010551600  lvl  1  siz    16  off     0
(RECORD (re real)
        (im real))
 94915010552752         red  CONST  typ INTEGER  val  0
 94915010552912       white  CONST  typ INTEGER  val  1
 94915010553072        blue  CONST  typ INTEGER  val  2
 94915010553264       color  TYPE   typ 94915010553168  lvl  1  siz     4  off     0
  0 ..   2
 94915010553680      person  TYPE   typ 94915010555504  lvl  1  siz    48  off     0
(RECORD (age integer)
        (friend (^ person))
        (location (RECORD (re real)
                          (im real)))
        (favorite   0 ..   2)
        (salary real))
 94915010553872          pp  TYPE   typ 94915010553776  lvl  1  siz     8  off     0
(^ person)
 94915010556464        john  VAR    4 typ 94915010553776  lvl  1  siz     8  off     0
(^ person)
(program graph1 (progn output)
                (progn (:= (aref (^ john)
                                 16)
                           3)
                       (:= (aref (^ john)
                                 16)
                           4.500000e+00)))