field->stringval: favorite
moverField->namestring: age
moverField->namestring: friend
moverField->namestring: location
moverField->namestring: favorite
fieldOffset: 32
makearef
var: 
(^ john)
off: 
32
areftok
(aref (^ john)
      32)
referenceTok
(aref (^ john)
      32)
field->stringval: age
moverField->namestring: age
fieldOffset: 0
makearef
var: 
(^ john)
off: 
0
areftok
(aref (^ john)
      0)
referenceTok
(aref (^ john)
      0)
field->stringval: friend
moverField->namestring: age
moverField->namestring: friend
fieldOffset: 8
makearef
var: 
(^ john)
off: 
8
areftok
(aref (^ john)
      8)
referenceTok
(aref (^ john)
      8)
field->stringval: salary
moverField->namestring: age
moverField->namestring: friend
moverField->namestring: location
moverField->namestring: favorite
moverField->namestring: salary
fieldOffset: 40
makearef
var: 
(^ john)
off: 
40
areftok
(aref (^ john)
      40)
referenceTok
(aref (^ john)
      40)
field->stringval: friend
moverField->namestring: age
moverField->namestring: friend
fieldOffset: 8
makearef
var: 
(^ fred)
off: 
8
areftok
(aref (^ fred)
      8)
referenceTok
(aref (^ fred)
      8)
field->stringval: location
moverField->namestring: age
moverField->namestring: friend
moverField->namestring: location
fieldOffset: 16
makearef
var: 
(^ mary)
off: 
16
areftok
(aref (^ mary)
      16)
referenceTok
(aref (^ mary)
      16)
field->stringval: age
moverField->namestring: age
fieldOffset: 0
makearef
var: 
(^ ptr)
off: 
0
areftok
(aref (^ ptr)
      0)
referenceTok
(aref (^ ptr)
      0)
field->stringval: friend
moverField->namestring: age
moverField->namestring: friend
fieldOffset: 8
makearef
var: 
(^ ptr)
off: 
8
areftok
(aref (^ ptr)
      8)
referenceTok
(aref (^ ptr)
      8)
yyparse result =        0
Symbol table level 0
 94801757676192        real  BASIC  basicdt   1          siz     8
 94801757676288     integer  BASIC  basicdt   0          siz     4
 94801757676384        char  BASIC  basicdt   2          siz     1
 94801757676480     boolean  BASIC  basicdt   3          siz     4
 94801757676576         exp  knd 5 0  typ 94801757676672  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94801757676864       trexp  knd 5 0  typ 94801757676960  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94801757677152         sin  knd 5 0  typ 94801757677248  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94801757677440         cos  knd 5 0  typ 94801757677536  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94801757677728       trsin  knd 5 0  typ 94801757677824  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94801757678016        sqrt  knd 5 0  typ 94801757678112  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94801757678304       round  knd 5 0  typ 94801757678400  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94801757678592      iround  knd 5 0  typ 94801757678688  lvl  0  siz     0  off     0
(FUNCTION integer
          real)
 94801757678880         ord  knd 5 0  typ 94801757678976  lvl  0  siz     0  off     0
(FUNCTION integer
          integer)
 94801757679168         new  knd 5 0  typ 94801757679264  lvl  0  siz     0  off     0
(FUNCTION integer
          integer)
 94801757679456       trnew  knd 5 0  typ 94801757679552  lvl  0  siz     0  off     0
(FUNCTION integer
          integer)
 94801757679744       write  knd 5 0  typ 94801757679840  lvl  0  siz     0  off     0
(FUNCTION NULL
          char)
 94801757680032     writeln  knd 5 0  typ 94801757680128  lvl  0  siz     0  off     0
(FUNCTION NULL
          char)
 94801757680320      writef  knd 5 0  typ 94801757680416  lvl  0  siz     0  off     0
(FUNCTION NULL
          real)
 94801757680608    writelnf  knd 5 0  typ 94801757680704  lvl  0  siz     0  off     0
(FUNCTION NULL
          real)
 94801757680896      writei  knd 5 0  typ 94801757680992  lvl  0  siz     0  off     0
(FUNCTION NULL
          integer)
 94801757681184    writelni  knd 5 0  typ 94801757681280  lvl  0  siz     0  off     0
(FUNCTION NULL
          integer)
 94801757681472        read  knd 5 0  typ 94801757681568  lvl  0  siz     0  off     0
(FUNCTION NULL
          NULL)
 94801757681760      readln  knd 5 0  typ 94801757681856  lvl  0  siz     0  off     0
(FUNCTION NULL
          NULL)
 94801757682048         eof  knd 5 0  typ 94801757682144  lvl  0  siz     0  off     0
(FUNCTION boolean
          NULL)
Symbol table level 1
 94801757708368     complex  TYPE   typ 94801757708080  lvl  1  siz    16  off     0
(RECORD (re real)
        (im real))
 94801757709232         red  CONST  typ INTEGER  val  0
 94801757709392       white  CONST  typ INTEGER  val  1
 94801757709552        blue  CONST  typ INTEGER  val  2
 94801757709744       color  TYPE   typ 94801757709648  lvl  1  siz     4  off     0
  0 ..   2
 94801757710160      person  TYPE   typ 94801757711984  lvl  1  siz    48  off     0
(RECORD (age integer)
        (friend (^ person))
        (location (RECORD (re real)
                          (im real)))
        (favorite   0 ..   2)
        (salary real))
 94801757710352          pp  TYPE   typ 94801757710256  lvl  1  siz     8  off     0
(^ person)
 94801757712944           c  VAR    0 typ 94801757708080  lvl  1  siz    16  off     0
(RECORD (re real)
        (im real))
 94801757713296         sum  VAR    0 typ integer  lvl  1  siz     4  off    16
 94801757714032        john  VAR    4 typ 94801757710256  lvl  1  siz     8  off    24
(^ person)
 94801757714128        mary  VAR    4 typ 94801757710256  lvl  1  siz     8  off    32
(^ person)
 94801757714224        fred  VAR    4 typ 94801757710256  lvl  1  siz     8  off    40
(^ person)
 94801757714320         ptr  VAR    4 typ 94801757710256  lvl  1  siz     8  off    48
(^ person)
(program graph1 (progn output)
                (progn (:= (aref (^ john)
                                 32)
                           2)
                       (:= (aref (^ john)
                                 0)
                           19)
                       (:= (aref (^ john)
                                 8)
                           mary)
                       (:= (aref (^ john)
                                 40)
                           4.000000e+04)
                       (:= (aref (^ fred)
                                 8)
                           0)
                       (:= (aref (^ mary)
                                 16)
                           c)
                       (:= sum (+ sum (aref (^ ptr)
                                            0)))
                       (:= ptr (aref (^ ptr)
                                     8))))