reduce dot var: 
(^ john)
recsym->namestring: 
curfield->namestring: age
curfield->namestring: friend
offset: 8
reduce dot var: 
(^ (aref (^ john)
         8))
recsym->namestring: person
curfield->namestring: 
offset: 0
reduce dot var: 
(^ john)
recsym->namestring: 
curfield->namestring: age
curfield->namestring: friend
offset: 8
reduce dot var: 
(^ (aref (^ john)
         8))
recsym->namestring: person
curfield->namestring: 
offset: 0
reduce dot var: 
(^ john)
recsym->namestring: 
curfield->namestring: age
curfield->namestring: friend
offset: 8
reduce dot var: 
(^ (aref (^ john)
         8))
recsym->namestring: person
curfield->namestring: 
offset: 0
reduce dot var: 
(aref (^ (aref (^ john)
               8))
      0)
recsym->namestring: person
curfield->namestring: 
offset: 0
reduce dot var: 
(^ john)
recsym->namestring: 
curfield->namestring: age
curfield->namestring: friend
offset: 8
reduce dot var: 
(^ (aref (^ john)
         8))
recsym->namestring: person
curfield->namestring: 
offset: 0
reduce dot var: 
(^ (aref (^ (aref (^ john)
                  8))
         0))
recsym->namestring: age
curfield->namestring: integer
curfield->namestring: char
curfield->namestring: boolean
curfield->namestring: exp
curfield->namestring: trexp
curfield->namestring: sin
curfield->namestring: cos
curfield->namestring: trsin
curfield->namestring: sqrt
curfield->namestring: round
curfield->namestring: iround
curfield->namestring: ord
curfield->namestring: new
curfield->namestring: trnew
curfield->namestring: write
curfield->namestring: writeln
curfield->namestring: writef
curfield->namestring: writelnf
curfield->namestring: writei
curfield->namestring: writelni
curfield->namestring: read
curfield->namestring: readln
curfield->namestring: eof
offset: 0
reduce dot var: 
(aref (^ (aref (^ (aref (^ john)
                        8))
               0))
      0)
recsym->namestring: age
curfield->namestring: integer
curfield->namestring: char
curfield->namestring: boolean
curfield->namestring: exp
curfield->namestring: trexp
curfield->namestring: sin
curfield->namestring: cos
curfield->namestring: trsin
curfield->namestring: sqrt
curfield->namestring: round
curfield->namestring: iround
curfield->namestring: ord
curfield->namestring: new
curfield->namestring: trnew
curfield->namestring: write
curfield->namestring: writeln
curfield->namestring: writef
curfield->namestring: writelnf
curfield->namestring: writei
curfield->namestring: writelni
curfield->namestring: read
curfield->namestring: readln
curfield->namestring: eof
offset: 0
yyparse result =        0
Symbol table level 1
 93906127294544     complex  TYPE   typ 93906127294256  lvl  1  siz    16  off     0
(RECORD (re real)
        (im real))
 93906127295408         red  CONST  typ INTEGER  val  0
 93906127295568       white  CONST  typ INTEGER  val  1
 93906127295728        blue  CONST  typ INTEGER  val  2
 93906127295920       color  TYPE   typ 93906127295824  lvl  1  siz     4  off     0
  0 ..   2
 93906127296336      person  TYPE   typ 93906127298160  lvl  1  siz    48  off     0
(RECORD (age integer)
        (friend (^ person))
        (location (RECORD (re real)
                          (im real)))
        (favorite   0 ..   2)
        (salary real))
 93906127296528          pp  TYPE   typ 93906127296432  lvl  1  siz     8  off     0
(^ person)
 93906127299120        john  VAR    4 typ 93906127296432  lvl  1  siz     8  off     0
(^ person)
(program graph1 (progn output)
                (progn (:= (aref (^ (aref (^ john)
                                          8))
                                 0)
                           23)
                       (:= (aref (^ (aref (^ john)
                                          8))
                                 0)
                           1.200000e+03)
                       (:= (aref (^ (aref (^ john)
                                          8))
                                 0)
                           5.400000e+00)
                       (:= (aref (^ (aref (^ (aref (^ john)
                                                   8))
                                          0))
                                 0)
                           97)))