reduce dot var: 
(^ john)
recsym->namestring: 
curfield->namestring: age
curfield->namestring: friend
curfield->namestring: location
offset: 16
reduce dot var: 
(aref (^ john)
      16)
recsym->namestring: location
curfield->namestring: 
offset: 0
reduce dot var: 
(^ john)
recsym->namestring: 
curfield->namestring: age
curfield->namestring: friend
curfield->namestring: location
offset: 16
reduce dot var: 
(aref (^ john)
      16)
recsym->namestring: location
curfield->namestring: 
offset: 0
yyparse result =        0
Symbol table level 1
 94625160286288     complex  TYPE   typ 94625160286000  lvl  1  siz    16  off     0
(RECORD (re real)
        (im real))
 94625160287152         red  CONST  typ INTEGER  val  0
 94625160287312       white  CONST  typ INTEGER  val  1
 94625160287472        blue  CONST  typ INTEGER  val  2
 94625160287664       color  TYPE   typ 94625160287568  lvl  1  siz     4  off     0
  0 ..   2
 94625160288080      person  TYPE   typ 94625160289904  lvl  1  siz    48  off     0
(RECORD (age integer)
        (friend (^ person))
        (location (RECORD (re real)
                          (im real)))
        (favorite   0 ..   2)
        (salary real))
 94625160288272          pp  TYPE   typ 94625160288176  lvl  1  siz     8  off     0
(^ person)
 94625160290864        john  VAR    4 typ 94625160288176  lvl  1  siz     8  off     0
(^ person)
(program graph1 (progn output)
                (progn (:= (aref (^ john)
                                 16)
                           3)
                       (:= (aref (^ john)
                                 16)
                           4.500000e+00)))