instfields
typetok->stringval: real

mover->stringval re
mover->symtype->namestring real
mover->stringval im
mover->symtype->namestring real
instrec
res 20
argstok
argstok->stringval: re

argstok
argstok->stringval: im

typename: complex
typesym->basicdt: 0
typename: color
typesym->basicdt: 0
typename: pp
typesym->basicdt: 4
instfields
typetok->stringval: integer

mover->stringval age
mover->symtype->namestring integer
instfields
typetok->stringval: pp

mover->stringval friend
mover->symtype->namestring pp
instfields
typetok->stringval: complex

mover->stringval location
mover->symtype->namestring complex
instfields
typetok->stringval: color

mover->stringval favorite
mover->symtype->namestring color
instfields
typetok->stringval: real

mover->stringval salary
mover->symtype->namestring real
instrec
res 20
argstok
argstok->stringval: age

argstok
argstok->stringval: friend

argstok
argstok->stringval: location

argstok
argstok->stringval: favorite

argstok
argstok->stringval: salary

typename: person
typesym->basicdt: 0
(^)
reducedot
var: 
(^ john)
field->stringval: location

recordSymbol->namestring: 
moverField->namestring: age
moverField->namestring: friend
moverField->namestring: location
found field match
offset: 16
setting basicdt
referenceTok->symtype->namestring: location
referenceTok->symtype->basicdt: 0
reducedot
var: 
(aref (^ john)
      16)
field->stringval: re

Called on non-record type
recordSymbol->namestring: location
New recordSymbol->namestring: complex
recordSymbol->namestring: complex
moverField->namestring: re
found field match
offset: 0
setting basicdt
referenceTok->symtype->namestring: re
referenceTok->symtype->basicdt: 0
lhs
(aref (^ john)
      16)
lhs->basicdt: 0

op
(:=)
rhs
3
(^)
reducedot
var: 
(^ john)
field->stringval: location

recordSymbol->namestring: 
moverField->namestring: age
moverField->namestring: friend
moverField->namestring: location
found field match
offset: 16
setting basicdt
referenceTok->symtype->namestring: location
referenceTok->symtype->basicdt: 0
reducedot
var: 
(aref (^ john)
      16)
field->stringval: im

Called on non-record type
recordSymbol->namestring: location
New recordSymbol->namestring: complex
recordSymbol->namestring: complex
moverField->namestring: re
moverField->namestring: im
found field match
offset: 8
setting basicdt
referenceTok->symtype->namestring: im
referenceTok->symtype->basicdt: 0
lhs
(aref (^ john)
      24)
lhs->basicdt: 0

op
(:=)
rhs
4.500000e+00
yyparse result =        0
Symbol table level 0
 94381733388960        real  BASIC  basicdt   1          siz     8
 94381733389056     integer  BASIC  basicdt   0          siz     4
 94381733389152        char  BASIC  basicdt   2          siz     1
 94381733389248     boolean  BASIC  basicdt   3          siz     4
 94381733389344         exp  knd 5 0  typ 94381733389440  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94381733389632       trexp  knd 5 0  typ 94381733389728  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94381733389920         sin  knd 5 0  typ 94381733390016  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94381733390208         cos  knd 5 0  typ 94381733390304  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94381733390496       trsin  knd 5 0  typ 94381733390592  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94381733390784        sqrt  knd 5 0  typ 94381733390880  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94381733391072       round  knd 5 0  typ 94381733391168  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94381733391360      iround  knd 5 0  typ 94381733391456  lvl  0  siz     0  off     0
(FUNCTION integer
          real)
 94381733391648         ord  knd 5 0  typ 94381733391744  lvl  0  siz     0  off     0
(FUNCTION integer
          integer)
 94381733391936         new  knd 5 0  typ 94381733392032  lvl  0  siz     0  off     0
(FUNCTION integer
          integer)
 94381733392224       trnew  knd 5 0  typ 94381733392320  lvl  0  siz     0  off     0
(FUNCTION integer
          integer)
 94381733392512       write  knd 5 0  typ 94381733392608  lvl  0  siz     0  off     0
(FUNCTION NULL
          char)
 94381733392800     writeln  knd 5 0  typ 94381733392896  lvl  0  siz     0  off     0
(FUNCTION NULL
          char)
 94381733393088      writef  knd 5 0  typ 94381733393184  lvl  0  siz     0  off     0
(FUNCTION NULL
          real)
 94381733393376    writelnf  knd 5 0  typ 94381733393472  lvl  0  siz     0  off     0
(FUNCTION NULL
          real)
 94381733393664      writei  knd 5 0  typ 94381733393760  lvl  0  siz     0  off     0
(FUNCTION NULL
          integer)
 94381733393952    writelni  knd 5 0  typ 94381733394048  lvl  0  siz     0  off     0
(FUNCTION NULL
          integer)
 94381733394240        read  knd 5 0  typ 94381733394336  lvl  0  siz     0  off     0
(FUNCTION NULL
          NULL)
 94381733394528      readln  knd 5 0  typ 94381733394624  lvl  0  siz     0  off     0
(FUNCTION NULL
          NULL)
 94381733394816         eof  knd 5 0  typ 94381733394912  lvl  0  siz     0  off     0
(FUNCTION boolean
          NULL)
Symbol table level 1
 94381733429344     complex  TYPE   typ 94381733429056  lvl  1  siz    16  off     0
(RECORD (re real)
        (im real))
 94381733430208         red  CONST  typ INTEGER  val  0
 94381733430368       white  CONST  typ INTEGER  val  1
 94381733430528        blue  CONST  typ INTEGER  val  2
 94381733430720       color  TYPE   typ 94381733430624  lvl  1  siz     4  off     0
  0 ..   2
 94381733431136      person  TYPE   typ 94381733432960  lvl  1  siz    48  off     0
(RECORD (age integer)
        (friend (^ person))
        (location (RECORD (re real)
                          (im real)))
        (favorite   0 ..   2)
        (salary real))
 94381733431328          pp  TYPE   typ 94381733431232  lvl  1  siz     8  off     0
(^ person)
 94381733433920        john  VAR    4 typ 94381733431232  lvl  1  siz     8  off     0
(^ person)
(program graph1 (progn output)
                (progn (:= (aref (^ john)
                                 16)
                           3)
                       (:= (aref (^ john)
                                 24)
                           4.500000e+00)))