reduce dot var: 
(^ john)
recsym->namestring: 
curfield->namestring: age
curfield->namestring: friend
offset: 8
reduce dot var: 
(^ (aref (^ john)
         8))
recsym->namestring: person
curfield->namestring: 
offset: 0
reduce dot var: 
(^ john)
recsym->namestring: 
curfield->namestring: age
curfield->namestring: friend
offset: 8
reduce dot var: 
(^ (aref (^ john)
         8))
recsym->namestring: person
curfield->namestring: 
offset: 0
reduce dot var: 
(^ john)
recsym->namestring: 
curfield->namestring: age
curfield->namestring: friend
offset: 8
reduce dot var: 
(^ (aref (^ john)
         8))
recsym->namestring: person
curfield->namestring: 
offset: 0
reduce dot var: 
(aref (^ (aref (^ john)
               8))
      0)
recsym->namestring: person
curfield->namestring: 
offset: 0
reduce dot var: 
(^ john)
recsym->namestring: 
curfield->namestring: age
curfield->namestring: friend
offset: 8
reduce dot var: 
(^ (aref (^ john)
         8))
recsym->namestring: person
curfield->namestring: 
offset: 0
reduce dot var: 
(^ (aref (^ (aref (^ john)
                  8))
         0))
recsym->namestring: age
curfield->namestring: integer
curfield->namestring: char
curfield->namestring: boolean
curfield->namestring: exp
curfield->namestring: trexp
curfield->namestring: sin
curfield->namestring: cos
curfield->namestring: trsin
curfield->namestring: sqrt
curfield->namestring: round
curfield->namestring: iround
curfield->namestring: ord
curfield->namestring: new
curfield->namestring: trnew
curfield->namestring: write
curfield->namestring: writeln
curfield->namestring: writef
curfield->namestring: writelnf
curfield->namestring: writei
curfield->namestring: writelni
curfield->namestring: read
curfield->namestring: readln
curfield->namestring: eof
offset: 0
reduce dot var: 
(aref (^ (aref (^ (aref (^ john)
                        8))
               0))
      0)
recsym->namestring: age
curfield->namestring: integer
curfield->namestring: char
curfield->namestring: boolean
curfield->namestring: exp
curfield->namestring: trexp
curfield->namestring: sin
curfield->namestring: cos
curfield->namestring: trsin
curfield->namestring: sqrt
curfield->namestring: round
curfield->namestring: iround
curfield->namestring: ord
curfield->namestring: new
curfield->namestring: trnew
curfield->namestring: write
curfield->namestring: writeln
curfield->namestring: writef
curfield->namestring: writelnf
curfield->namestring: writei
curfield->namestring: writelni
curfield->namestring: read
curfield->namestring: readln
curfield->namestring: eof
offset: 0
yyparse result =        0
Symbol table level 1
 93967272624208     complex  TYPE   typ 93967272623920  lvl  1  siz    16  off     0
(RECORD (re real)
        (im real))
 93967272625072         red  CONST  typ INTEGER  val  0
 93967272625232       white  CONST  typ INTEGER  val  1
 93967272625392        blue  CONST  typ INTEGER  val  2
 93967272625584       color  TYPE   typ 93967272625488  lvl  1  siz     4  off     0
  0 ..   2
 93967272626000      person  TYPE   typ 93967272627824  lvl  1  siz    48  off     0
(RECORD (age integer)
        (friend (^ person))
        (location (RECORD (re real)
                          (im real)))
        (favorite   0 ..   2)
        (salary real))
 93967272626192          pp  TYPE   typ 93967272626096  lvl  1  siz     8  off     0
(^ person)
 93967272628784        john  VAR    4 typ 93967272626096  lvl  1  siz     8  off     0
(^ person)
(program graph1 (progn output)
                (progn (:= (aref (^ (aref (^ john)
                                          8))
                                 0)
                           23)
                       (:= (aref (^ (aref (^ john)
                                          8))
                                 0)
                           1.200000e+03)
                       (:= (aref (^ (aref (^ john)
                                          8))
                                 0)
                           5.400000e+00)
                       (:= (aref (^ (aref (^ (aref (^ john)
                                                   8))
                                          0))
                                 0)
                           97)))