instfields
typetok->stringval: real

mover->stringval re
mover->symtype->namestring real
mover->stringval im
mover->symtype->namestring real
instrec
res 20
argstok
argstok->stringval: re

argstok
argstok->stringval: im

typename: complex
typesym->basicdt: 0
typename: color
typesym->basicdt: 0
typename: pp
typesym->basicdt: 4
instfields
typetok->stringval: integer

mover->stringval age
mover->symtype->namestring integer
instfields
typetok->stringval: pp

mover->stringval friend
mover->symtype->namestring pp
instfields
typetok->stringval: complex

mover->stringval location
mover->symtype->namestring complex
instfields
typetok->stringval: color

mover->stringval favorite
mover->symtype->namestring color
instfields
typetok->stringval: real

mover->stringval salary
mover->symtype->namestring real
instrec
res 20
argstok
argstok->stringval: age

argstok
argstok->stringval: friend

argstok
argstok->stringval: location

argstok
argstok->stringval: favorite

argstok
argstok->stringval: salary

typename: person
typesym->basicdt: 0
(^)
reducedot
var: 
(^ john)
field->stringval: location

recordSymbol->namestring: 
moverField->namestring: age
moverField->namestring: friend
moverField->namestring: location
found field match
offset: 16
setting basicdt
referenceTok->symtype->namestring: location
referenceTok->symtype->basicdt: 0
reducedot
var: 
(aref (^ john)
      16)
field->stringval: re

Called on non-record type
recordSymbol->namestring: location
New recordSymbol->namestring: complex
recordSymbol->namestring: complex
moverField->namestring: re
found field match
offset: 0
setting basicdt
referenceTok->symtype->namestring: re
referenceTok->symtype->basicdt: 0
lhs
(aref (^ john)
      16)
lhs->basicdt: 0

op
(:=)
rhs
3
(^)
reducedot
var: 
(^ john)
field->stringval: location

recordSymbol->namestring: 
moverField->namestring: age
moverField->namestring: friend
moverField->namestring: location
found field match
offset: 16
setting basicdt
referenceTok->symtype->namestring: location
referenceTok->symtype->basicdt: 0
reducedot
var: 
(aref (^ john)
      16)
field->stringval: im

Called on non-record type
recordSymbol->namestring: location
New recordSymbol->namestring: complex
recordSymbol->namestring: complex
moverField->namestring: re
moverField->namestring: im
found field match
offset: 8
setting basicdt
referenceTok->symtype->namestring: im
referenceTok->symtype->basicdt: 0
lhs
(aref (^ john)
      24)
lhs->basicdt: 0

op
(:=)
rhs
4.500000e+00
yyparse result =        0
Symbol table level 0
 94680731636384        real  BASIC  basicdt   1          siz     8
 94680731636480     integer  BASIC  basicdt   0          siz     4
 94680731636576        char  BASIC  basicdt   2          siz     1
 94680731636672     boolean  BASIC  basicdt   3          siz     4
 94680731636768         exp  knd 5 0  typ 94680731636864  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94680731637056       trexp  knd 5 0  typ 94680731637152  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94680731637344         sin  knd 5 0  typ 94680731637440  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94680731637632         cos  knd 5 0  typ 94680731637728  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94680731637920       trsin  knd 5 0  typ 94680731638016  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94680731638208        sqrt  knd 5 0  typ 94680731638304  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94680731638496       round  knd 5 0  typ 94680731638592  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94680731638784      iround  knd 5 0  typ 94680731638880  lvl  0  siz     0  off     0
(FUNCTION integer
          real)
 94680731639072         ord  knd 5 0  typ 94680731639168  lvl  0  siz     0  off     0
(FUNCTION integer
          integer)
 94680731639360         new  knd 5 0  typ 94680731639456  lvl  0  siz     0  off     0
(FUNCTION integer
          integer)
 94680731639648       trnew  knd 5 0  typ 94680731639744  lvl  0  siz     0  off     0
(FUNCTION integer
          integer)
 94680731639936       write  knd 5 0  typ 94680731640032  lvl  0  siz     0  off     0
(FUNCTION NULL
          char)
 94680731640224     writeln  knd 5 0  typ 94680731640320  lvl  0  siz     0  off     0
(FUNCTION NULL
          char)
 94680731640512      writef  knd 5 0  typ 94680731640608  lvl  0  siz     0  off     0
(FUNCTION NULL
          real)
 94680731640800    writelnf  knd 5 0  typ 94680731640896  lvl  0  siz     0  off     0
(FUNCTION NULL
          real)
 94680731641088      writei  knd 5 0  typ 94680731641184  lvl  0  siz     0  off     0
(FUNCTION NULL
          integer)
 94680731641376    writelni  knd 5 0  typ 94680731641472  lvl  0  siz     0  off     0
(FUNCTION NULL
          integer)
 94680731641664        read  knd 5 0  typ 94680731641760  lvl  0  siz     0  off     0
(FUNCTION NULL
          NULL)
 94680731641952      readln  knd 5 0  typ 94680731642048  lvl  0  siz     0  off     0
(FUNCTION NULL
          NULL)
 94680731642240         eof  knd 5 0  typ 94680731642336  lvl  0  siz     0  off     0
(FUNCTION boolean
          NULL)
Symbol table level 1
 94680731676768     complex  TYPE   typ 94680731676480  lvl  1  siz    16  off     0
(RECORD (re real)
        (im real))
 94680731677632         red  CONST  typ INTEGER  val  0
 94680731677792       white  CONST  typ INTEGER  val  1
 94680731677952        blue  CONST  typ INTEGER  val  2
 94680731678144       color  TYPE   typ 94680731678048  lvl  1  siz     4  off     0
  0 ..   2
 94680731678560      person  TYPE   typ 94680731680384  lvl  1  siz    48  off     0
(RECORD (age integer)
        (friend (^ person))
        (location (RECORD (re real)
                          (im real)))
        (favorite   0 ..   2)
        (salary real))
 94680731678752          pp  TYPE   typ 94680731678656  lvl  1  siz     8  off     0
(^ person)
 94680731681344        john  VAR    4 typ 94680731678656  lvl  1  siz     8  off     0
(^ person)
(program graph1 (progn output)
                (progn (:= (aref (^ john)
                                 16)
                           3)
                       (:= (aref (^ john)
                                 24)
                           4.500000e+00)))