recsym->namestring: person
curfield->namestring: age
curfield->namestring: friend
offset: 8
recsym->namestring: person
curfield->namestring: age
offset: 0
recsym->namestring: person
curfield->namestring: age
curfield->namestring: friend
offset: 8
recsym->namestring: person
curfield->namestring: age
curfield->namestring: friend
curfield->namestring: location
curfield->namestring: favorite
curfield->namestring: salary
offset: 40
recsym->namestring: person
curfield->namestring: age
curfield->namestring: friend
offset: 8
recsym->namestring: person
curfield->namestring: age
curfield->namestring: friend
curfield->namestring: location
offset: 16
recsym->namestring: location
curfield->namestring: re
curfield->namestring: im
offset: 8
recsym->namestring: person
curfield->namestring: age
curfield->namestring: friend
offset: 8
recsym->namestring: person
curfield->namestring: age
curfield->namestring: friend
offset: 8
recsym->namestring: person
curfield->namestring: age
curfield->namestring: friend
curfield->namestring: location
offset: 16
recsym->namestring: location
curfield->namestring: re
offset: 0
yyparse result =        0
Symbol table level 1
 93915302051920     complex  TYPE   typ 93915302051632  lvl  1  siz    16  off     0
(RECORD (re real)
        (im real))
 93915302052784         red  CONST  typ INTEGER  val  0
 93915302052944       white  CONST  typ INTEGER  val  1
 93915302053104        blue  CONST  typ INTEGER  val  2
 93915302053296       color  TYPE   typ 93915302053200  lvl  1  siz     4  off     0
  0 ..   2
 93915302053712      person  TYPE   typ 93915302055536  lvl  1  siz    48  off     0
(RECORD (age integer)
        (friend (^ person))
        (location (RECORD (re real)
                          (im real)))
        (favorite   0 ..   2)
        (salary real))
 93915302053904          pp  TYPE   typ 93915302053808  lvl  1  siz     8  off     0
(^ person)
 93915302056496        john  VAR    4 typ 93915302053808  lvl  1  siz     8  off     0
(^ person)
(program graph1 (progn output)
                (progn (:= (aref (^ (aref (^ john)
                                          8))
                                 0)
                           23)
                       (:= (aref (^ (aref (^ john)
                                          8))
                                 40)
                           1.200000e+03)
                       (:= (aref (^ (aref (^ john)
                                          8))
                                 24)
                           5.400000e+00)
                       (:= (aref (^ (aref (^ (aref (^ john)
                                                   8))
                                          8))
                                 16)
                           9.700000e+01)))