lhs
i
lhs->basicdt: 0

op
(:=)
rhs
0
lhs
i
lhs->basicdt: 0

op
(<>)
rhs
10
lhs
i
lhs->basicdt: 0

op
(+)
rhs
1
lhs
i
lhs->basicdt: 0

op
(:=)
rhs
(+ i 1)
yyparse result =        0
Symbol table level 0
 94148377944736        real  BASIC  basicdt   1          siz     8
 94148377944832     integer  BASIC  basicdt   0          siz     4
 94148377944928        char  BASIC  basicdt   2          siz     1
 94148377945024     boolean  BASIC  basicdt   3          siz     4
 94148377945120         exp  knd 5 0  typ 94148377945216  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94148377945408       trexp  knd 5 0  typ 94148377945504  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94148377945696         sin  knd 5 0  typ 94148377945792  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94148377945984         cos  knd 5 0  typ 94148377946080  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94148377946272       trsin  knd 5 0  typ 94148377946368  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94148377946560        sqrt  knd 5 0  typ 94148377946656  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94148377946848       round  knd 5 0  typ 94148377946944  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94148377947136      iround  knd 5 0  typ 94148377947232  lvl  0  siz     0  off     0
(FUNCTION integer
          real)
 94148377947424         ord  knd 5 0  typ 94148377947520  lvl  0  siz     0  off     0
(FUNCTION integer
          integer)
 94148377947712         new  knd 5 0  typ 94148377947808  lvl  0  siz     0  off     0
(FUNCTION integer
          integer)
 94148377948000       trnew  knd 5 0  typ 94148377948096  lvl  0  siz     0  off     0
(FUNCTION integer
          integer)
 94148377948288       write  knd 5 0  typ 94148377948384  lvl  0  siz     0  off     0
(FUNCTION NULL
          char)
 94148377948576     writeln  knd 5 0  typ 94148377948672  lvl  0  siz     0  off     0
(FUNCTION NULL
          char)
 94148377948864      writef  knd 5 0  typ 94148377948960  lvl  0  siz     0  off     0
(FUNCTION NULL
          real)
 94148377949152    writelnf  knd 5 0  typ 94148377949248  lvl  0  siz     0  off     0
(FUNCTION NULL
          real)
 94148377949440      writei  knd 5 0  typ 94148377949536  lvl  0  siz     0  off     0
(FUNCTION NULL
          integer)
 94148377949728    writelni  knd 5 0  typ 94148377949824  lvl  0  siz     0  off     0
(FUNCTION NULL
          integer)
 94148377950016        read  knd 5 0  typ 94148377950112  lvl  0  siz     0  off     0
(FUNCTION NULL
          NULL)
 94148377950304      readln  knd 5 0  typ 94148377950400  lvl  0  siz     0  off     0
(FUNCTION NULL
          NULL)
 94148377950592         eof  knd 5 0  typ 94148377950688  lvl  0  siz     0  off     0
(FUNCTION boolean
          NULL)
Symbol table level 1
 94148377976304           i  VAR    0 typ integer  lvl  1  siz     4  off     0
(program graph1 (progn output)
                (progn (:= i 0)
                       (progn (label 0)
                              (if (<> i 10)
                                  (progn (progn (:= i (+ i 1)))
                                         (goto 0))))))