instfields
typetok->stringval: real

mover->stringval re
mover->symtype->namestring real
mover->stringval im
mover->symtype->namestring real
instrec
res 20
argstok
argstok->stringval: re

argstok
argstok->stringval: im

typename: complex
typesym->basicdt: 0
typename: color
typesym->basicdt: 0
typename: pp
typesym->basicdt: 4
instfields
typetok->stringval: integer

mover->stringval age
mover->symtype->namestring integer
instfields
typetok->stringval: pp

mover->stringval friend
mover->symtype->namestring pp
instfields
typetok->stringval: complex

mover->stringval location
mover->symtype->namestring complex
instfields
typetok->stringval: color

mover->stringval favorite
mover->symtype->namestring color
instfields
typetok->stringval: real

mover->stringval salary
mover->symtype->namestring real
instrec
res 20
argstok
argstok->stringval: age

argstok
argstok->stringval: friend

argstok
argstok->stringval: location

argstok
argstok->stringval: favorite

argstok
argstok->stringval: salary

typename: person
typesym->basicdt: 0
(^)
reducedot
var: 
(^ john)
field->stringval: favorite

recordSymbol->namestring: 
moverField->namestring: age
moverField->namestring: friend
moverField->namestring: location
moverField->namestring: favorite
found field match
offset: 32
setting basicdt
referenceTok->symtype->namestring: favorite
referenceTok->symtype->basicdt: 0
lhs
(aref (^ john)
      32)
lhs->basicdt: 0

op
(:=)
rhs
2
(^)
reducedot
var: 
(^ john)
field->stringval: age

recordSymbol->namestring: 
moverField->namestring: age
found field match
offset: 0
setting basicdt
referenceTok->symtype->namestring: age
referenceTok->symtype->basicdt: 0
lhs
(aref (^ john)
      0)
lhs->basicdt: 0

op
(:=)
rhs
19
(^)
reducedot
var: 
(^ john)
field->stringval: friend

recordSymbol->namestring: 
moverField->namestring: age
moverField->namestring: friend
found field match
offset: 8
setting basicdt
referenceTok->symtype->namestring: friend
referenceTok->symtype->basicdt: 0
lhs
(aref (^ john)
      8)
lhs->basicdt: 4

op
(:=)
rhs
mary
(^)
reducedot
var: 
(^ john)
field->stringval: salary

recordSymbol->namestring: 
moverField->namestring: age
moverField->namestring: friend
moverField->namestring: location
moverField->namestring: favorite
moverField->namestring: salary
found field match
offset: 40
setting basicdt
referenceTok->symtype->namestring: salary
referenceTok->symtype->basicdt: 0
lhs
(aref (^ john)
      40)
lhs->basicdt: 1

op
(:=)
rhs
4.000000e+04
(^)
reducedot
var: 
(^ fred)
field->stringval: friend

recordSymbol->namestring: 
moverField->namestring: age
moverField->namestring: friend
found field match
offset: 8
setting basicdt
referenceTok->symtype->namestring: friend
referenceTok->symtype->basicdt: 0
lhs
(aref (^ fred)
      8)
lhs->basicdt: 4

op
(:=)
rhs
res 15
(^)
reducedot
var: 
(^ mary)
field->stringval: location

recordSymbol->namestring: 
moverField->namestring: age
moverField->namestring: friend
moverField->namestring: location
found field match
offset: 16
setting basicdt
referenceTok->symtype->namestring: location
referenceTok->symtype->basicdt: 0
lhs
(aref (^ mary)
      16)
lhs->basicdt: 0

op
(:=)
rhs
c
(^)
reducedot
var: 
(^ ptr)
field->stringval: age

recordSymbol->namestring: 
moverField->namestring: age
found field match
offset: 0
setting basicdt
referenceTok->symtype->namestring: age
referenceTok->symtype->basicdt: 0
lhs
sum
lhs->basicdt: 0

op
(+)
rhs
(aref (^ ptr)
      0)
lhs
sum
lhs->basicdt: 0

op
(:=)
rhs
(+ sum (aref (^ ptr)
             0))
(^)
reducedot
var: 
(^ ptr)
field->stringval: friend

recordSymbol->namestring: 
moverField->namestring: age
moverField->namestring: friend
found field match
offset: 8
setting basicdt
referenceTok->symtype->namestring: friend
referenceTok->symtype->basicdt: 0
lhs
ptr
lhs->basicdt: 4

op
(:=)
rhs
(aref (^ ptr)
      8)
yyparse result =        0
Symbol table level 0
 94475317621408        real  BASIC  basicdt   1          siz     8
 94475317621504     integer  BASIC  basicdt   0          siz     4
 94475317621600        char  BASIC  basicdt   2          siz     1
 94475317621696     boolean  BASIC  basicdt   3          siz     4
 94475317621792         exp  knd 5 0  typ 94475317621888  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94475317622080       trexp  knd 5 0  typ 94475317622176  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94475317622368         sin  knd 5 0  typ 94475317622464  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94475317622656         cos  knd 5 0  typ 94475317622752  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94475317622944       trsin  knd 5 0  typ 94475317623040  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94475317623232        sqrt  knd 5 0  typ 94475317623328  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94475317623520       round  knd 5 0  typ 94475317623616  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94475317623808      iround  knd 5 0  typ 94475317623904  lvl  0  siz     0  off     0
(FUNCTION integer
          real)
 94475317624096         ord  knd 5 0  typ 94475317624192  lvl  0  siz     0  off     0
(FUNCTION integer
          integer)
 94475317624384         new  knd 5 0  typ 94475317624480  lvl  0  siz     0  off     0
(FUNCTION integer
          integer)
 94475317624672       trnew  knd 5 0  typ 94475317624768  lvl  0  siz     0  off     0
(FUNCTION integer
          integer)
 94475317624960       write  knd 5 0  typ 94475317625056  lvl  0  siz     0  off     0
(FUNCTION NULL
          char)
 94475317625248     writeln  knd 5 0  typ 94475317625344  lvl  0  siz     0  off     0
(FUNCTION NULL
          char)
 94475317625536      writef  knd 5 0  typ 94475317625632  lvl  0  siz     0  off     0
(FUNCTION NULL
          real)
 94475317625824    writelnf  knd 5 0  typ 94475317625920  lvl  0  siz     0  off     0
(FUNCTION NULL
          real)
 94475317626112      writei  knd 5 0  typ 94475317626208  lvl  0  siz     0  off     0
(FUNCTION NULL
          integer)
 94475317626400    writelni  knd 5 0  typ 94475317626496  lvl  0  siz     0  off     0
(FUNCTION NULL
          integer)
 94475317626688        read  knd 5 0  typ 94475317626784  lvl  0  siz     0  off     0
(FUNCTION NULL
          NULL)
 94475317626976      readln  knd 5 0  typ 94475317627072  lvl  0  siz     0  off     0
(FUNCTION NULL
          NULL)
 94475317627264         eof  knd 5 0  typ 94475317627360  lvl  0  siz     0  off     0
(FUNCTION boolean
          NULL)
Symbol table level 1
 94475317661792     complex  TYPE   typ 94475317661504  lvl  1  siz    16  off     0
(RECORD (re real)
        (im real))
 94475317662656         red  CONST  typ INTEGER  val  0
 94475317662816       white  CONST  typ INTEGER  val  1
 94475317662976        blue  CONST  typ INTEGER  val  2
 94475317663168       color  TYPE   typ 94475317663072  lvl  1  siz     4  off     0
  0 ..   2
 94475317663584      person  TYPE   typ 94475317665408  lvl  1  siz    48  off     0
(RECORD (age integer)
        (friend (^ person))
        (location (RECORD (re real)
                          (im real)))
        (favorite   0 ..   2)
        (salary real))
 94475317663776          pp  TYPE   typ 94475317663680  lvl  1  siz     8  off     0
(^ person)
 94475317666368           c  VAR    0 typ 94475317661504  lvl  1  siz    16  off     0
(RECORD (re real)
        (im real))
 94475317666720         sum  VAR    0 typ integer  lvl  1  siz     4  off    16
 94475317667456        john  VAR    4 typ 94475317663680  lvl  1  siz     8  off    24
(^ person)
 94475317667552        mary  VAR    4 typ 94475317663680  lvl  1  siz     8  off    32
(^ person)
 94475317667648        fred  VAR    4 typ 94475317663680  lvl  1  siz     8  off    40
(^ person)
 94475317667744         ptr  VAR    4 typ 94475317663680  lvl  1  siz     8  off    48
(^ person)
(program graph1 (progn output)
                (progn (:= (aref (^ john)
                                 32)
                           2)
                       (:= (aref (^ john)
                                 0)
                           19)
                       (:= (aref (^ john)
                                 8)
                           mary)
                       (:= (aref (^ john)
                                 40)
                           4.000000e+04)
                       (:= (aref (^ fred)
                                 8)
                           0)
                       (:= (aref (^ mary)
                                 16)
                           c)
                       (:= sum (+ sum (aref (^ ptr)
                                            0)))
                       (:= ptr (aref (^ ptr)
                                     8))))