recordSymbol->kind: 7
field->stringval: friend
moverField->namestring: age
moverField->namestring: friend
fieldOffset: 8
recordSymbol->kind: 9
field->stringval: age
moverField->namestring: age
fieldOffset: 0
recordSymbol->kind: 7
field->stringval: friend
moverField->namestring: age
moverField->namestring: friend
fieldOffset: 8
recordSymbol->kind: 9
field->stringval: salary
moverField->namestring: age
moverField->namestring: friend
moverField->namestring: location
moverField->namestring: favorite
moverField->namestring: salary
fieldOffset: 40
recordSymbol->kind: 7
field->stringval: friend
moverField->namestring: age
moverField->namestring: friend
fieldOffset: 8
recordSymbol->kind: 9
field->stringval: location
moverField->namestring: age
moverField->namestring: friend
moverField->namestring: location
fieldOffset: 16
recordSymbol->kind: 0
field->stringval: im
moverField->namestring: re
moverField->namestring: im
fieldOffset: 8
recordSymbol->kind: 7
field->stringval: friend
moverField->namestring: age
moverField->namestring: friend
fieldOffset: 8
recordSymbol->kind: 9
field->stringval: friend
moverField->namestring: age
moverField->namestring: friend
fieldOffset: 8
recordSymbol->kind: 9
field->stringval: location
moverField->namestring: age
moverField->namestring: friend
moverField->namestring: location
fieldOffset: 16
recordSymbol->kind: 0
field->stringval: re
moverField->namestring: re
fieldOffset: 0
yyparse result =        0
Symbol table level 0
 94002327327392        real  BASIC  basicdt   1          siz     8
 94002327327488     integer  BASIC  basicdt   0          siz     4
 94002327327584        char  BASIC  basicdt   2          siz     1
 94002327327680     boolean  BASIC  basicdt   3          siz     4
 94002327327776         exp  knd 5 0  typ 94002327327872  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94002327328064       trexp  knd 5 0  typ 94002327328160  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94002327328352         sin  knd 5 0  typ 94002327328448  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94002327328640         cos  knd 5 0  typ 94002327328736  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94002327328928       trsin  knd 5 0  typ 94002327329024  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94002327329216        sqrt  knd 5 0  typ 94002327329312  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94002327329504       round  knd 5 0  typ 94002327329600  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 94002327329792      iround  knd 5 0  typ 94002327329888  lvl  0  siz     0  off     0
(FUNCTION integer
          real)
 94002327330080         ord  knd 5 0  typ 94002327330176  lvl  0  siz     0  off     0
(FUNCTION integer
          integer)
 94002327330368         new  knd 5 0  typ 94002327330464  lvl  0  siz     0  off     0
(FUNCTION integer
          integer)
 94002327330656       trnew  knd 5 0  typ 94002327330752  lvl  0  siz     0  off     0
(FUNCTION integer
          integer)
 94002327330944       write  knd 5 0  typ 94002327331040  lvl  0  siz     0  off     0
(FUNCTION NULL
          char)
 94002327331232     writeln  knd 5 0  typ 94002327331328  lvl  0  siz     0  off     0
(FUNCTION NULL
          char)
 94002327331520      writef  knd 5 0  typ 94002327331616  lvl  0  siz     0  off     0
(FUNCTION NULL
          real)
 94002327331808    writelnf  knd 5 0  typ 94002327331904  lvl  0  siz     0  off     0
(FUNCTION NULL
          real)
 94002327332096      writei  knd 5 0  typ 94002327332192  lvl  0  siz     0  off     0
(FUNCTION NULL
          integer)
 94002327332384    writelni  knd 5 0  typ 94002327332480  lvl  0  siz     0  off     0
(FUNCTION NULL
          integer)
 94002327332672        read  knd 5 0  typ 94002327332768  lvl  0  siz     0  off     0
(FUNCTION NULL
          NULL)
 94002327332960      readln  knd 5 0  typ 94002327333056  lvl  0  siz     0  off     0
(FUNCTION NULL
          NULL)
 94002327333248         eof  knd 5 0  typ 94002327333344  lvl  0  siz     0  off     0
(FUNCTION boolean
          NULL)
Symbol table level 1
 94002327359568     complex  TYPE   typ 94002327359280  lvl  1  siz    16  off     0
(RECORD (re real)
        (im real))
 94002327360432         red  CONST  typ INTEGER  val  0
 94002327360592       white  CONST  typ INTEGER  val  1
 94002327360752        blue  CONST  typ INTEGER  val  2
 94002327360944       color  TYPE   typ 94002327360848  lvl  1  siz     4  off     0
  0 ..   2
 94002327361360      person  TYPE   typ 94002327363184  lvl  1  siz    48  off     0
(RECORD (age integer)
        (friend (^ person))
        (location (RECORD (re real)
                          (im real)))
        (favorite   0 ..   2)
        (salary real))
 94002327361552          pp  TYPE   typ 94002327361456  lvl  1  siz     8  off     0
(^ person)
 94002327364144        john  VAR    4 typ 94002327361456  lvl  1  siz     8  off     0
(^ person)
(program graph1 (progn output)
                (progn (:= (aref (^ (aref (^ john)
                                          8))
                                 0)
                           23)
                       (:= (aref (^ (aref (^ john)
                                          8))
                                 40)
                           1.200000e+03)
                       (:= (aref (^ (aref (^ john)
                                          8))
                                 24)
                           5.400000e+00)
                       (:= (aref (^ (aref (^ (aref (^ john)
                                                   8))
                                          8))
                                 16)
                           9.700000e+01)))