instfields
typetok->stringval: real

mover->stringval re
mover->symtype->namestring real
mover->stringval im
mover->symtype->namestring real
instrec
res 20
argstok
argstok->stringval: re

argstok
argstok->stringval: im

typename: complex
typesym->basicdt: 0
typename: color
typesym->basicdt: 0
typename: pp
typesym->basicdt: 4
instfields
typetok->stringval: integer

mover->stringval age
mover->symtype->namestring integer
instfields
typetok->stringval: pp

mover->stringval friend
mover->symtype->namestring pp
instfields
typetok->stringval: complex

mover->stringval location
mover->symtype->namestring complex
instfields
typetok->stringval: color

mover->stringval favorite
mover->symtype->namestring color
instfields
typetok->stringval: real

mover->stringval salary
mover->symtype->namestring real
instrec
res 20
argstok
argstok->stringval: age

argstok
argstok->stringval: friend

argstok
argstok->stringval: location

argstok
argstok->stringval: favorite

argstok
argstok->stringval: salary

typename: person
typesym->basicdt: 0
(^)
reducedot
var: 
(^ john)
field->stringval: favorite

recordSymbol->namestring: 
moverField->namestring: age
moverField->namestring: friend
moverField->namestring: location
moverField->namestring: favorite
found field match
offset: 32
setting basicdt
referenceTok->symtype->namestring: favorite
referenceTok->symtype->basicdt: 0
lhs
(aref (^ john)
      32)
lhs->basicdt: 0

op
(:=)
rhs
2
(^)
reducedot
var: 
(^ john)
field->stringval: age

recordSymbol->namestring: 
moverField->namestring: age
found field match
offset: 0
setting basicdt
referenceTok->symtype->namestring: age
referenceTok->symtype->basicdt: 0
lhs
(aref (^ john)
      0)
lhs->basicdt: 0

op
(:=)
rhs
19
(^)
reducedot
var: 
(^ john)
field->stringval: friend

recordSymbol->namestring: 
moverField->namestring: age
moverField->namestring: friend
found field match
offset: 8
setting basicdt
referenceTok->symtype->namestring: friend
referenceTok->symtype->basicdt: 0
lhs
(aref (^ john)
      8)
lhs->basicdt: 4

op
(:=)
rhs
mary
(^)
reducedot
var: 
(^ john)
field->stringval: salary

recordSymbol->namestring: 
moverField->namestring: age
moverField->namestring: friend
moverField->namestring: location
moverField->namestring: favorite
moverField->namestring: salary
found field match
offset: 40
setting basicdt
referenceTok->symtype->namestring: salary
referenceTok->symtype->basicdt: 0
lhs
(aref (^ john)
      40)
lhs->basicdt: 1

op
(:=)
rhs
4.000000e+04
(^)
reducedot
var: 
(^ fred)
field->stringval: friend

recordSymbol->namestring: 
moverField->namestring: age
moverField->namestring: friend
found field match
offset: 8
setting basicdt
referenceTok->symtype->namestring: friend
referenceTok->symtype->basicdt: 0
lhs
(aref (^ fred)
      8)
lhs->basicdt: 4

op
(:=)
rhs
res 15
(^)
reducedot
var: 
(^ mary)
field->stringval: location

recordSymbol->namestring: 
moverField->namestring: age
moverField->namestring: friend
moverField->namestring: location
found field match
offset: 16
setting basicdt
referenceTok->symtype->namestring: location
referenceTok->symtype->basicdt: 0
lhs
(aref (^ mary)
      16)
lhs->basicdt: 0

op
(:=)
rhs
c
(^)
reducedot
var: 
(^ ptr)
field->stringval: age

recordSymbol->namestring: 
moverField->namestring: age
found field match
offset: 0
setting basicdt
referenceTok->symtype->namestring: age
referenceTok->symtype->basicdt: 0
lhs
sum
lhs->basicdt: 0

op
(+)
rhs
(aref (^ ptr)
      0)
lhs
sum
lhs->basicdt: 0

op
(:=)
rhs
(+ sum (aref (^ ptr)
             0))
(^)
reducedot
var: 
(^ ptr)
field->stringval: friend

recordSymbol->namestring: 
moverField->namestring: age
moverField->namestring: friend
found field match
offset: 8
setting basicdt
referenceTok->symtype->namestring: friend
referenceTok->symtype->basicdt: 0
lhs
ptr
lhs->basicdt: 4

op
(:=)
rhs
(aref (^ ptr)
      8)
yyparse result =        0
Symbol table level 0
 93895887848096        real  BASIC  basicdt   1          siz     8
 93895887848192     integer  BASIC  basicdt   0          siz     4
 93895887848288        char  BASIC  basicdt   2          siz     1
 93895887848384     boolean  BASIC  basicdt   3          siz     4
 93895887848480         exp  knd 5 0  typ 93895887848576  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 93895887848768       trexp  knd 5 0  typ 93895887848864  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 93895887849056         sin  knd 5 0  typ 93895887849152  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 93895887849344         cos  knd 5 0  typ 93895887849440  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 93895887849632       trsin  knd 5 0  typ 93895887849728  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 93895887849920        sqrt  knd 5 0  typ 93895887850016  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 93895887850208       round  knd 5 0  typ 93895887850304  lvl  0  siz     0  off     0
(FUNCTION real
          real)
 93895887850496      iround  knd 5 0  typ 93895887850592  lvl  0  siz     0  off     0
(FUNCTION integer
          real)
 93895887850784         ord  knd 5 0  typ 93895887850880  lvl  0  siz     0  off     0
(FUNCTION integer
          integer)
 93895887851072         new  knd 5 0  typ 93895887851168  lvl  0  siz     0  off     0
(FUNCTION integer
          integer)
 93895887851360       trnew  knd 5 0  typ 93895887851456  lvl  0  siz     0  off     0
(FUNCTION integer
          integer)
 93895887851648       write  knd 5 0  typ 93895887851744  lvl  0  siz     0  off     0
(FUNCTION NULL
          char)
 93895887851936     writeln  knd 5 0  typ 93895887852032  lvl  0  siz     0  off     0
(FUNCTION NULL
          char)
 93895887852224      writef  knd 5 0  typ 93895887852320  lvl  0  siz     0  off     0
(FUNCTION NULL
          real)
 93895887852512    writelnf  knd 5 0  typ 93895887852608  lvl  0  siz     0  off     0
(FUNCTION NULL
          real)
 93895887852800      writei  knd 5 0  typ 93895887852896  lvl  0  siz     0  off     0
(FUNCTION NULL
          integer)
 93895887853088    writelni  knd 5 0  typ 93895887853184  lvl  0  siz     0  off     0
(FUNCTION NULL
          integer)
 93895887853376        read  knd 5 0  typ 93895887853472  lvl  0  siz     0  off     0
(FUNCTION NULL
          NULL)
 93895887853664      readln  knd 5 0  typ 93895887853760  lvl  0  siz     0  off     0
(FUNCTION NULL
          NULL)
 93895887853952         eof  knd 5 0  typ 93895887854048  lvl  0  siz     0  off     0
(FUNCTION boolean
          NULL)
Symbol table level 1
 93895887888480     complex  TYPE   typ 93895887888192  lvl  1  siz    16  off     0
(RECORD (re real)
        (im real))
 93895887889344         red  CONST  typ INTEGER  val  0
 93895887889504       white  CONST  typ INTEGER  val  1
 93895887889664        blue  CONST  typ INTEGER  val  2
 93895887889856       color  TYPE   typ 93895887889760  lvl  1  siz     4  off     0
  0 ..   2
 93895887890272      person  TYPE   typ 93895887892096  lvl  1  siz    48  off     0
(RECORD (age integer)
        (friend (^ person))
        (location (RECORD (re real)
                          (im real)))
        (favorite   0 ..   2)
        (salary real))
 93895887890464          pp  TYPE   typ 93895887890368  lvl  1  siz     8  off     0
(^ person)
 93895887893056           c  VAR    0 typ 93895887888192  lvl  1  siz    16  off     0
(RECORD (re real)
        (im real))
 93895887893408         sum  VAR    0 typ integer  lvl  1  siz     4  off    16
 93895887894144        john  VAR    4 typ 93895887890368  lvl  1  siz     8  off    24
(^ person)
 93895887894240        mary  VAR    4 typ 93895887890368  lvl  1  siz     8  off    32
(^ person)
 93895887894336        fred  VAR    4 typ 93895887890368  lvl  1  siz     8  off    40
(^ person)
 93895887894432         ptr  VAR    4 typ 93895887890368  lvl  1  siz     8  off    48
(^ person)
(program graph1 (progn output)
                (progn (:= (aref (^ john)
                                 32)
                           2)
                       (:= (aref (^ john)
                                 0)
                           19)
                       (:= (aref (^ john)
                                 8)
                           mary)
                       (:= (aref (^ john)
                                 40)
                           4.000000e+04)
                       (:= (aref (^ fred)
                                 8)
                           0)
                       (:= (aref (^ mary)
                                 16)
                           c)
                       (:= sum (+ sum (aref (^ ptr)
                                            0)))
                       (:= ptr (aref (^ ptr)
                                     8))))