recsym->namestring: person
curfield->namestring: age
curfield->namestring: friend
offset: 8
recsym->namestring: person
curfield->namestring: age
offset: 0
recsym->namestring: person
curfield->namestring: age
curfield->namestring: friend
offset: 8
recsym->namestring: person
curfield->namestring: age
curfield->namestring: friend
curfield->namestring: location
curfield->namestring: favorite
curfield->namestring: salary
offset: 40
recsym->namestring: person
curfield->namestring: age
curfield->namestring: friend
offset: 8
recsym->namestring: person
curfield->namestring: age
curfield->namestring: friend
curfield->namestring: location
offset: 16
recsym->namestring: location
curfield->namestring: re
curfield->namestring: im
offset: 8
recsym->namestring: person
curfield->namestring: age
curfield->namestring: friend
offset: 8
recsym->namestring: person
curfield->namestring: age
curfield->namestring: friend
offset: 8
recsym->namestring: person
curfield->namestring: age
curfield->namestring: friend
curfield->namestring: location
offset: 16
recsym->namestring: location
curfield->namestring: re
offset: 0
yyparse result =        0
Symbol table level 1
 94663789744208     complex  TYPE   typ 94663789743920  lvl  1  siz    16  off     0
(RECORD (re real)
        (im real))
 94663789745072         red  CONST  typ INTEGER  val  0
 94663789745232       white  CONST  typ INTEGER  val  1
 94663789745392        blue  CONST  typ INTEGER  val  2
 94663789745584       color  TYPE   typ 94663789745488  lvl  1  siz     4  off     0
  0 ..   2
 94663789746000      person  TYPE   typ 94663789747824  lvl  1  siz    48  off     0
(RECORD (age integer)
        (friend (^ person))
        (location (RECORD (re real)
                          (im real)))
        (favorite   0 ..   2)
        (salary real))
 94663789746192          pp  TYPE   typ 94663789746096  lvl  1  siz     8  off     0
(^ person)
 94663789748784        john  VAR    4 typ 94663789746096  lvl  1  siz     8  off     0
(^ person)
(program graph1 (progn output)
                (progn (:= (aref (^ (aref (^ john)
                                          8))
                                 0)
                           23)
                       (:= (aref (^ (aref (^ john)
                                          8))
                                 40)
                           1.200000e+03)
                       (:= (aref (^ (aref (^ john)
                                          8))
                                 24)
                           5.400000e+00)
                       (:= (aref (^ (aref (^ (aref (^ john)
                                                   8))
                                          8))
                                 16)
                           9.700000e+01)))