recsym->namestring: person
curfield->namestring: age
curfield->namestring: friend
offset: 8
recsym->namestring: person
curfield->namestring: age
offset: 0
recsym->namestring: person
curfield->namestring: age
curfield->namestring: friend
offset: 8
recsym->namestring: person
curfield->namestring: age
curfield->namestring: friend
curfield->namestring: location
curfield->namestring: favorite
curfield->namestring: salary
offset: 40
recsym->namestring: person
curfield->namestring: age
curfield->namestring: friend
offset: 8
recsym->namestring: person
curfield->namestring: age
curfield->namestring: friend
curfield->namestring: location
offset: 16
recsym->namestring: location
curfield->namestring: re
curfield->namestring: im
offset: 8
recsym->namestring: person
curfield->namestring: age
curfield->namestring: friend
offset: 8
recsym->namestring: person
curfield->namestring: age
curfield->namestring: friend
offset: 8
recsym->namestring: person
curfield->namestring: age
curfield->namestring: friend
curfield->namestring: location
offset: 16
recsym->namestring: location
curfield->namestring: re
offset: 0
yyparse result =        0
Symbol table level 1
 94899810222160     complex  TYPE   typ 94899810221872  lvl  1  siz    16  off     0
(RECORD (re real)
        (im real))
 94899810223024         red  CONST  typ INTEGER  val  0
 94899810223184       white  CONST  typ INTEGER  val  1
 94899810223344        blue  CONST  typ INTEGER  val  2
 94899810223536       color  TYPE   typ 94899810223440  lvl  1  siz     4  off     0
  0 ..   2
 94899810223952      person  TYPE   typ 94899810225776  lvl  1  siz    48  off     0
(RECORD (age integer)
        (friend (^ person))
        (location (RECORD (re real)
                          (im real)))
        (favorite   0 ..   2)
        (salary real))
 94899810224144          pp  TYPE   typ 94899810224048  lvl  1  siz     8  off     0
(^ person)
 94899810226736        john  VAR    4 typ 94899810224048  lvl  1  siz     8  off     0
(^ person)
(program graph1 (progn output)
                (progn (:= (aref (^ (aref (^ john)
                                          8))
                                 0)
                           23)
                       (:= (aref (^ (aref (^ john)
                                          8))
                                 40)
                           1.200000e+03)
                       (:= (aref (^ (aref (^ john)
                                          8))
                                 24)
                           5.400000e+00)
                       (:= (aref (^ (aref (^ (aref (^ john)
                                                   8))
                                          8))
                                 16)
                           9.700000e+01)))