reduce dot var: 
(^ john)
recsym->namestring: 
curfield->namestring: age
curfield->namestring: friend
curfield->namestring: location
curfield->namestring: favorite
offset: 32
reduce dot var: 
(^ john)
recsym->namestring: 
curfield->namestring: age
offset: 0
reduce dot var: 
(^ john)
recsym->namestring: 
curfield->namestring: age
curfield->namestring: friend
offset: 8
reduce dot var: 
(^ john)
recsym->namestring: 
curfield->namestring: age
curfield->namestring: friend
curfield->namestring: location
curfield->namestring: favorite
curfield->namestring: salary
offset: 40
reduce dot var: 
(^ fred)
recsym->namestring: 
curfield->namestring: age
curfield->namestring: friend
offset: 8
reduce dot var: 
(^ mary)
recsym->namestring: 
curfield->namestring: age
curfield->namestring: friend
curfield->namestring: location
offset: 16
reduce dot var: 
(^ ptr)
recsym->namestring: 
curfield->namestring: age
offset: 0
reduce dot var: 
(^ ptr)
recsym->namestring: 
curfield->namestring: age
curfield->namestring: friend
offset: 8
yyparse result =        0
Symbol table level 1
 94889960210512     complex  TYPE   typ 94889960210224  lvl  1  siz    16  off     0
(RECORD (re real)
        (im real))
 94889960211376         red  CONST  typ INTEGER  val  0
 94889960211536       white  CONST  typ INTEGER  val  1
 94889960211696        blue  CONST  typ INTEGER  val  2
 94889960211888       color  TYPE   typ 94889960211792  lvl  1  siz     4  off     0
  0 ..   2
 94889960212304      person  TYPE   typ 94889960214128  lvl  1  siz    48  off     0
(RECORD (age integer)
        (friend (^ person))
        (location (RECORD (re real)
                          (im real)))
        (favorite   0 ..   2)
        (salary real))
 94889960212496          pp  TYPE   typ 94889960212400  lvl  1  siz     8  off     0
(^ person)
 94889960215088           c  VAR    0 typ 94889960210224  lvl  1  siz    16  off     0
(RECORD (re real)
        (im real))
 94889960215440         sum  VAR    0 typ integer  lvl  1  siz     4  off    16
 94889960216176        john  VAR    4 typ 94889960212400  lvl  1  siz     8  off    24
(^ person)
 94889960216272        mary  VAR    4 typ 94889960212400  lvl  1  siz     8  off    32
(^ person)
 94889960216368        fred  VAR    4 typ 94889960212400  lvl  1  siz     8  off    40
(^ person)
 94889960216464         ptr  VAR    4 typ 94889960212400  lvl  1  siz     8  off    48
(^ person)
(program graph1 (progn output)
                (progn (:= (aref (^ john)
                                 32)
                           2)
                       (:= (aref (^ john)
                                 0)
                           19)
                       (:= (aref (^ john)
                                 8)
                           mary)
                       (:= (aref (^ john)
                                 40)
                           4.000000e+04)
                       (:= (aref (^ fred)
                                 8)
                           0)
                       (:= (aref (^ mary)
                                 16)
                           c)
                       (:= sum (+ sum (aref (^ ptr)
                                            0)))
                       (:= ptr (aref (^ ptr)
                                     8))))